# Pandas
Pandas is a data analysis library for python that enables powerful and easy ingress, manipulation, and storage of data.

In [1]:
# Importing Pandas as a dependency.
import pandas as pd

## Pandas Data Structures
Pandas features two major data structures: Series and DataFrames.

### Series
Series objects are indexed, one-dimensional arrays that behave similar to native python lists, as well as featuring several methods native to pandas.

In [83]:
# A native python list
my_data = ["a","b","c","d","e","f","h","i","j"]

# Conversion to Pandas Series object
my_series = pd.Series(my_data)

# OPTIONAL: Naming our series
my_series.name = "My Letters"

# Printing out our Series
my_series

0    a
1    b
2    c
3    d
4    e
5    f
6    h
7    i
8    j
Name: My Letters, dtype: object

In [81]:
import numpy as np
np.array(my_data)

array(['a', 'b', 'c', 'd', 'e', 'f', 'h', 'i', 'j'], dtype='<U1')

On the Left, the series index is visible, starting from 0. To the right is the data we created in our list. At the bottom, we can see the optional name we added to the series, as well as the datatype of the data within the series.

While this may not seem terribly impressive compared to a normal python list, this allows us to then use special pandas methods with our data. Below, the ```decribe()``` method is used to easily return statistical analysis on a set of data.

In [3]:
my_data_2 = [23,52,62,25,24,22,21,28,32]
my_series_2 = pd.Series(my_data_2)
my_series_2

0    23
1    52
2    62
3    25
4    24
5    22
6    21
7    28
8    32
dtype: int64

In [4]:
my_series_2.describe()

count     9.000000
mean     32.111111
std      14.709219
min      21.000000
25%      23.000000
50%      25.000000
75%      32.000000
max      62.000000
dtype: float64

Note that the datatype for the "describe" result is different -that is because this is Series of it's own!

### DataFrames
The second major Pandas datatype is the DataFrame. A DataFrame is a tabular (table-like), 2-dimensional(i.e., rows and columns) object that is in many ways the central part of the pandas library. DataFrames are both indexed, like Series, and labeled. The index corresponds to the rows of the DataFrame while the labels correspond to the columns.

In [85]:
# Iniitalizing a DataFrame using the first Series we created.
df = pd.DataFrame(my_series)

# Adding the second Series to the DataFrame
df["My Numbers"] = my_series_2

# Viewing the DataFrame
df

  My Letters  My Numbers
0          a          23
1          b          52
2          c          62
3          d          25
4          e          24
5          f          22
6          h          21
7          i          28
8          j          32

The DataFrame features the same index as the series used to create it's columns. Within the DataFrame, every row and column that makes it up is in fact its own Pandas Series.

## Creating DataFrames
There are numerous ways to create data frames conveniently built into Pandas depending on the structure of our target data. The following are just a few of the most common:

### A list of dictionaries
This method is ideal for creating dictionaries from data generated within a loop, such as iterating over data from an API.

In [6]:
# Create a series of dictionaries
my_dict_1 = {"Letters": "a", "Num_1": 23, "Num_2": 2}
my_dict_2 = {"Letters": "b", "Num_1": 26, "Num_2": 3}
my_dict_3 = {"Letters": "c", "Num_1": 32, "Num_2": 2}
my_dict_4 = {"Letters": "d", "Num_1": 21, "Num_2": 4}

# Add all of these dictionaries to a list
my_list = [my_dict_1, my_dict_2, my_dict_3, my_dict_4]

# Then convert that into a DataFrame
df = pd.DataFrame(my_list)
df

  Letters  Num_1  Num_2
0       a     23      2
1       b     26      3
2       c     32      2
3       d     21      4

### A dictionary of lists
A dictionary of lists is a quick way to hand-write small data into a DataFrame.

In [7]:
# Create a series of lists
column_a = ["a","b","c","d"]
column_b = [23,26,32,21]
column_c = [2,3,2,4]

# Insert them into a dictionary
my_dict = {"Letters": column_a, "Num_1": column_b, "Num_2": column_c}

# Then convert that into a DataFrame
df = pd.DataFrame(my_dict)
df

  Letters  Num_1  Num_2
0       a     23      2
1       b     26      3
2       c     32      2
3       d     21      4

### Reading from a SQL database
Data can be read directly from SQL databases using Pandas. For this example, we will use sqlalchemy to quickly build a SQL database from a SQLite file.

In [8]:
# Importing additional dependencies
from sqlalchemy import create_engine

# Path to SQLite file
database_path = "data_sources/Census_Data.sqlite"

# Creating the SQL database
engine = create_engine(f"sqlite:///{database_path}")

# Establisting a connection to our database
conn = engine.connect()

# Using pandas to read data out of SQL
census_data = pd.read_sql("SELECT * FROM Census_Data", conn)

# Because this DataFrame is so large, we will use the head() method to print out the top 5 entries.
census_data.head()

,CityState,city,state,Population,White Population,Black Population,Native American Population,Asian Population,Hispanic Population,Education None,...,Employment Female Computer Engineering,Median Age,Median Male Age,Median Female Age,Household Income,Income Per Capita,Median Gross Rent,Median Home Value,lat,lng
0,"HOUSTON, TX",HOUSTON,TX,3061887,1775897,684416,11586,230549,1368287,54180,...,22637,33.439583,32.550000,34.363542,56206.50000,32239.52083,956.708333,178233.6842,29.775734,-95.414548
1,"CHICAGO, IL",CHICAGO,IL,2702091,1318869,843633,7554,161478,785374,32800,...,18209,34.526786,33.798214,35.141071,57735.96429,38730.83929,1119.928571,264739.2857,41.867838,-87.673440
2,"BROOKLYN, NY",BROOKLYN,NY,2595259,1126111,870465,8744,297890,509243,48934,...,14845,35.175676,33.367568,36.578378,51469.18919,28309.67568,1261.783784,605743.2432,40.652805,-73.956528
3,"LOS ANGELES, CA",LOS ANGELES,CA,2426413,1068202,324842,15949,273829,1292382,62684,...,12329,35.335484,34.535484,36.061290,47494.58333,30073.19355,1201.766667,557115.0000,34.042209,-118.303468
4,"MIAMI, FL",MIAMI,FL,1820704,1361009,363514,2250,33144,1162711,27137,...,6969,38.740741,37.120370,40.262963,51232.90741,25949.35185,1260.833333,243279.6296,25.760268,-80.298511

Don't forget to shutdown the database when we are done with it!

In [9]:
engine.dispose()

### Web Scraping a table
You can scrape table elements directly from HTML using Pandas.

In [45]:
# Defining the URL to scrape from
url = "https://en.wikipedia.org/wiki/List_of_the_highest_major_summits_of_North_America"

# Converting all table elements from the page into DataFrames. This method returns a list of DataFrames from the URL.
mountains_table_list = pd.read_html(url)

# Parsing through the list to find the table we want
mountains_table_list[1]

,Rank,Mountain peak,Region,Mountain range,Elevation,Prominence,Isolation,Location
0,1,Denali[7][8][a](formerly Mount McKinley),Alaska,Alaska Range,"20,310 ft","20,146 ft",NaN,63°04′08″N 151°00′23″W﻿ / ﻿63.0690°N 151.0063°W
1,2,Mount Logan[9][10][b],Yukon,Saint Elias Mountains,"19,551 ft","17,215 ft",387 mi,60°34′02″N 140°24′20″W﻿ / ﻿60.5671°N 140.4055°W
2,3,Pico de Orizaba[11][12][c](Citlaltépetl),Puebla Veracruz,Cordillera Neovolcanica,"18,491 ft","16,148 ft",NaN,19°01′50″N 97°16′11″W﻿ / ﻿19.0305°N 97.2698°W
3,4,Mount Saint Elias[13][14][d],Alaska Yukon,Saint Elias Mountains,"18,009 ft","11,250 ft",25.6 mi,60°17′34″N 140°55′51″W﻿ / ﻿60.2927°N 140.9307°W
4,5,Popocatépetl[15][16][e][f],México Morelos Puebla,Cordillera Neovolcanica,"17,749 ft","9,974 ft",88.8 mi,19°01′21″N 98°37′40″W﻿ / ﻿19.0225°N 98.6278°W
...,...,...,...,...,...,...,...,...
196,197,Cornwall Mountain[467][468][ga],Colorado,San Juan Mountains,"12,291 ft","1,744 ft",5.2 mi,37°22′52″N 106°29′31″W﻿ / ﻿37.3811°N 106.4920°W
197,198,Mount Adams[469][470][471],Washington,Cascade Range,"12,281 ft","8,136 ft",45.8 mi,46°12′09″N 121°29′27″W﻿ / ﻿46.2024°N 121.4909°W
198,199,Mount Columbia[472][473][gb],Alberta British Columbia,Canadian Rockies,"12,274 ft","7,779 ft",98.2 mi,52°08′50″N 117°26′30″W﻿ / ﻿52.1473°N 117.4416°W
199,200,Mount King George[474][475],Yukon,Saint Elias Mountains,"12,274 ft","4,203 ft",7.02 mi,60°31′53″N 139°47′03″W﻿ / ﻿60.5314°N 139.7841°W
200,201,Mount Johansen[476],Yukon,Saint Elias Mountains,"12,270 ft","1,837 ft",12.43 mi,60°41′00″N 140°40′56″W﻿ / ﻿60.6832°N 140.6823°W

In [78]:
# It looks like the table we want is the second entry in the list of tables, so we will save it and print its head.
mountains_df = mountains_table_list[1]
mountains_df.head()

,Rank,Mountain peak,Region,Mountain range,Elevation,Prominence,Isolation,Location
0,1,Denali[7][8][a](formerly Mount McKinley),Alaska,Alaska Range,"20,310 ft","20,146 ft",NaN,63°04′08″N 151°00′23″W﻿ / ﻿63.0690°N 151.0063°W
1,2,Mount Logan[9][10][b],Yukon,Saint Elias Mountains,"19,551 ft","17,215 ft",387 mi,60°34′02″N 140°24′20″W﻿ / ﻿60.5671°N 140.4055°W
2,3,Pico de Orizaba[11][12][c](Citlaltépetl),Puebla Veracruz,Cordillera Neovolcanica,"18,491 ft","16,148 ft",NaN,19°01′50″N 97°16′11″W﻿ / ﻿19.0305°N 97.2698°W
3,4,Mount Saint Elias[13][14][d],Alaska Yukon,Saint Elias Mountains,"18,009 ft","11,250 ft",25.6 mi,60°17′34″N 140°55′51″W﻿ / ﻿60.2927°N 140.9307°W
4,5,Popocatépetl[15][16][e][f],México Morelos Puebla,Cordillera Neovolcanica,"17,749 ft","9,974 ft",88.8 mi,19°01′21″N 98°37′40″W﻿ / ﻿19.0225°N 98.6278°W

### Reading from a CSV
One of the most common ways to ingress data using Pandas, the humble CSV.

In [12]:
# Defining the CSV path
path = "data_sources/Census_Data.csv"

# Creating a DataFrame from the CSV
census_data = pd.read_csv(path)
census_data.head()

,CityState,city,state,Population,White Population,Black Population,Native American Population,Asian Population,Hispanic Population,Education None,...,Employment Female Computer Engineering,Median Age,Median Male Age,Median Female Age,Household Income,Income Per Capita,Median Gross Rent,Median Home Value,lat,lng
0,"HOUSTON, TX",HOUSTON,TX,3061887,1775897,684416,11586,230549,1368287,54180,...,22637,33.439583,32.550000,34.363542,56206.50000,32239.52083,956.708333,178233.6842,29.775734,-95.414548
1,"CHICAGO, IL",CHICAGO,IL,2702091,1318869,843633,7554,161478,785374,32800,...,18209,34.526786,33.798214,35.141071,57735.96429,38730.83929,1119.928571,264739.2857,41.867838,-87.673440
2,"BROOKLYN, NY",BROOKLYN,NY,2595259,1126111,870465,8744,297890,509243,48934,...,14845,35.175676,33.367568,36.578378,51469.18919,28309.67568,1261.783784,605743.2432,40.652805,-73.956528
3,"LOS ANGELES, CA",LOS ANGELES,CA,2426413,1068202,324842,15949,273829,1292382,62684,...,12329,35.335484,34.535484,36.061290,47494.58333,30073.19355,1201.766667,557115.0000,34.042209,-118.303468
4,"MIAMI, FL",MIAMI,FL,1820704,1361009,363514,2250,33144,1162711,27137,...,6969,38.740741,37.120370,40.262963,51232.90741,25949.35185,1260.833333,243279.6296,25.760268,-80.298510

## Reading from a DataFrame
Now that we have our data in a DataFrame format, we need to be able to use it. The first thing we will want to learn to that end is how to read data back out!

### Indexing
We can parse a DataFrame similar to how we might a list our dictionary, selecting the column by using its label as a key.

In [13]:
df['Letters']

0    a
1    b
2    c
3    d
Name: Letters, dtype: object

We can further drill down using the index.

In [14]:
df['Letters'][3]

'd'

### Using iloc[ ]
Another option is to navigate the DataFrame entirely by numbers using ```iloc[ ]```. We can retrieve a whole column:

In [15]:
df.iloc[:, 0] # Note the format here, [rows, columns]

0    a
1    b
2    c
3    d
Name: Letters, dtype: object

Or a single cell:

In [16]:
df.iloc[3, 0]

'd'

### Using loc[ ]
Thes do not always work well because of the way indexes can be set in DataFrames and generally appear cluttered or as a mass of incomprehensible numbers. To get around this, we can use the ```loc[ ]``` attribute.

In [17]:
df = df.set_index('Letters')
df

         Num_1  Num_2
Letters
a           23      2
b           26      3
c           32      2
d           21      4

Because there is no numerical index for us to gauge what item we want with, instead we will use loc

In [18]:
df.loc["d"]

Num_1    21
Num_2     4
Name: d, dtype: int64

In [19]:
df.loc["d","Num_1"]

21

### Conditional views

In [79]:
# Set the index for the mountains DataFrame to the rank column
mountains_df = mountains_df.set_index('Rank')
# Use lambda functions to convert the Prominence, Elevation, and Isolation to numerical datatypes
def convert_ht(x):
    height = x.replace(",","").replace("\xa0ft","")
    return int(height)

def convert_mi(x):
    if isinstance(x, str):
        x = float(x.replace(",","").replace("\xa0mi",""))
    return x

def remove_bad_space(x):
    return x.replace("\xa0"," ")

mountains_df['Region'] = mountains_df['Region'].apply(lambda x:remove_bad_space(x))
mountains_df['Elevation'] = mountains_df['Elevation'].apply(lambda x:convert_ht(x))
mountains_df['Prominence'] = mountains_df['Prominence'].apply(lambda x:convert_ht(x))
mountains_df['Isolation'] = mountains_df['Isolation'].apply(lambda x:convert_mi(x))
mountains_df.head()

,Mountain peak,Region,Mountain range,Elevation,Prominence,Isolation,Location
Rank,,,,,,,
1,Denali[7][8][a](formerly Mount McKinley),Alaska,Alaska Range,20310,20146,NaN,63°04′08″N 151°00′23″W﻿ / ﻿63.0690°N 151.0063°W
2,Mount Logan[9][10][b],Yukon,Saint Elias Mountains,19551,17215,387.0,60°34′02″N 140°24′20″W﻿ / ﻿60.5671°N 140.4055°W
3,Pico de Orizaba[11][12][c](Citlaltépetl),Puebla Veracruz,Cordillera Neovolcanica,18491,16148,NaN,19°01′50″N 97°16′11″W﻿ / ﻿19.0305°N 97.2698°W
4,Mount Saint Elias[13][14][d],Alaska Yukon,Saint Elias Mountains,18009,11250,25.6,60°17′34″N 140°55′51″W﻿ / ﻿60.2927°N 140.9307°W
5,Popocatépetl[15][16][e][f],México Morelos Puebla,Cordillera Neovolcanica,17749,9974,88.8,19°01′21″N 98°37′40″W﻿ / ﻿19.0225°N 98.6278°W

Read with one condition

In [21]:
# Create a Boolean Series
mountains_df['Region'] == "Alaska"

Rank
1       True
2      False
3      False
4      False
5      False
       ...
197    False
198    False
199    False
200    False
201    False
Name: Region, Length: 201, dtype: bool

In [22]:
# Use Boolean Series as a key to output data
mountains_df[mountains_df['Region'] == "Alaska"].head()

,Mountain peak,Region,Mountain range,Elevation,Prominence,Isolation,Location
Rank,,,,,,,
1,Denali[7][8][a](formerly Mount McKinley),Alaska,Alaska Range,20310,20146,NaN,63°04′08″N 151°00′23″W﻿ / ﻿63.0690°N 151.0063°W
6,Mount Foraker[17][18][g],Alaska,Alaska Range,17400,7250,14.27,62°57′37″N 151°23′59″W﻿ / ﻿62.9604°N 151.3998°W
10,Mount Bona[25][26][k],Alaska,Saint Elias Mountains,16550,6900,49.70,61°23′08″N 141°44′58″W﻿ / ﻿61.3856°N 141.7495°W
12,Mount Blackburn[29][30][31][m],Alaska,Wrangell Mountains,16390,11640,60.70,61°43′50″N 143°24′11″W﻿ / ﻿61.7305°N 143.4031°W
13,Mount Sanford[32][33],Alaska,Wrangell Mountains,16237,7687,40.30,62°12′48″N 144°07′45″W﻿ / ﻿62.2132°N 144.1292°W

We can also parse a DataFrame using multiple conditions

In [23]:
mountains_df[(mountains_df['Region'] == "Alaska") & (mountains_df['Elevation'] > 15000)]

,Mountain peak,Region,Mountain range,Elevation,Prominence,Isolation,Location
Rank,,,,,,,
1,Denali[7][8][a](formerly Mount McKinley),Alaska,Alaska Range,20310,20146,NaN,63°04′08″N 151°00′23″W﻿ / ﻿63.0690°N 151.0063°W
6,Mount Foraker[17][18][g],Alaska,Alaska Range,17400,7250,14.27,62°57′37″N 151°23′59″W﻿ / ﻿62.9604°N 151.3998°W
10,Mount Bona[25][26][k],Alaska,Saint Elias Mountains,16550,6900,49.70,61°23′08″N 141°44′58″W﻿ / ﻿61.3856°N 141.7495°W
12,Mount Blackburn[29][30][31][m],Alaska,Wrangell Mountains,16390,11640,60.70,61°43′50″N 143°24′11″W﻿ / ﻿61.7305°N 143.4031°W
13,Mount Sanford[32][33],Alaska,Wrangell Mountains,16237,7687,40.30,62°12′48″N 144°07′45″W﻿ / ﻿62.2132°N 144.1292°W

## Data Manipulation in Pandas
Now that we know how to view our data, we can begin manipulating it.

### Drop
To remove unnecessary data elements, we can use the ```drop()``` method.

In [24]:
# Removing the Location column
mountains_df.drop(columns="Location",inplace=True)
mountains_df.head()

,Mountain peak,Region,Mountain range,Elevation,Prominence,Isolation
Rank,,,,,,
1,Denali[7][8][a](formerly Mount McKinley),Alaska,Alaska Range,20310,20146,NaN
2,Mount Logan[9][10][b],Yukon,Saint Elias Mountains,19551,17215,387.0
3,Pico de Orizaba[11][12][c](Citlaltépetl),Puebla Veracruz,Cordillera Neovolcanica,18491,16148,NaN
4,Mount Saint Elias[13][14][d],Alaska Yukon,Saint Elias Mountains,18009,11250,25.6
5,Popocatépetl[15][16][e][f],México Morelos Puebla,Cordillera Neovolcanica,17749,9974,88.8

### DropNA
We can remove data elements from our DataFrame that contain empty cells using the ```dropna()``` method.

In [25]:
# We can use .info() to see what columns have null values
mountains_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 201 entries, 1 to 201
Data columns (total 6 columns):
Mountain peak     201 non-null object
Region            201 non-null object
Mountain range    201 non-null object
Elevation         201 non-null int64
Prominence        201 non-null int64
Isolation         196 non-null float64
dtypes: float64(1), int64(2), object(3)
memory usage: 11.0+ KB

In [26]:
# Using .drop() to remove rows with empty cells
mountains_df.dropna(how="any").head()

,Mountain peak,Region,Mountain range,Elevation,Prominence,Isolation
Rank,,,,,,
2,Mount Logan[9][10][b],Yukon,Saint Elias Mountains,19551,17215,387.00
4,Mount Saint Elias[13][14][d],Alaska Yukon,Saint Elias Mountains,18009,11250,25.60
5,Popocatépetl[15][16][e][f],México Morelos Puebla,Cordillera Neovolcanica,17749,9974,88.80
6,Mount Foraker[17][18][g],Alaska,Alaska Range,17400,7250,14.27
7,Mount Lucania[19][20][h][i],Yukon,Saint Elias Mountains,17257,10105,26.70

### At and Iat
The ```at[ ]``` and ```iat[ ]``` are similiar to ```loc[ ]``` and ```iloc[ ]```, but instead of viewing the data, they allow us to manipulate it directly.

In [27]:
df

         Num_1  Num_2
Letters
a           23      2
b           26      3
c           32      2
d           21      4

In [28]:
df.at["a","Num_2"] = 5
df

         Num_1  Num_2
Letters
a           23      5
b           26      3
c           32      2
d           21      4

In [29]:
df.iat[0,1] = 2
df

         Num_1  Num_2
Letters
a           23      2
b           26      3
c           32      2
d           21      4

### Append
Append is a method for combining two DataFrames to create a stack

In [30]:
df

         Num_1  Num_2
Letters
a           23      2
b           26      3
c           32      2
d           21      4

In [31]:
my_dict = {"Letters": ["e","f","g"], "Num_1": [20,23,24], "Num_2": [2,1,3]}
df2 = pd.DataFrame(my_dict).set_index("Letters")
df2

         Num_1  Num_2
Letters
e           20      2
f           23      1
g           24      3

In [32]:
df3 = df.append(df2)
df3

         Num_1  Num_2
Letters
a           23      2
b           26      3
c           32      2
d           21      4
e           20      2
f           23      1
g           24      3

### Join
Join also combines DataFrames, but merges them along the lateral dimension.

In [33]:
my_dict = {"Letters": ["a","b","c"], "Num_1": [14,13,14], "Num_2": [7,10,13]}
df = pd.DataFrame(my_dict).set_index("Letters")
df

         Num_1  Num_2
Letters
a           14      7
b           13     10
c           14     13

In [34]:
my_dict = {"Letters": ["a","b","c"], "Num_3": [20,23,24], "Num_4": [2,1,3]}
df2 = pd.DataFrame(my_dict).set_index("Letters")
df2

         Num_3  Num_4
Letters
a           20      2
b           23      1
c           24      3

In [35]:
df3 = df.join(df2)
df3

         Num_1  Num_2  Num_3  Num_4
Letters
a           14      7     20      2
b           13     10     23      1
c           14     13     24      3

### GroupBy

In [1]:
mgbdf = mountains_df.groupby("Region").agg(["mean","min","max","std"])
mgbdf["Elevation"].loc['Alaska British Columbia', "std"]
mgbdf

NameError: name 'mountains_df' is not defined

In [76]:
mgbdf["Prominence"]

                                  mean    min    max          std
Region
Alaska                     5388.000000   1650  20146  4114.345274
Alaska British Columbia    7987.000000   2979  12995  7082.381520
Alaska Yukon               6810.600000   1950  11250  3489.060877
Alberta British Columbia   7779.000000   7779   7779          NaN
Arizona                    6039.000000   6039   6039          NaN
British Columbia           7618.000000   2782  10791  4255.607712
California                 3259.380952   1676  10080  2512.198429
Chiapas Guatemala          3402.000000   3402   3402          NaN
Colima Jalisco             2001.000000   2001   2001          NaN
Colorado                   2605.474359   1645   9093  1140.405678
Costa Rica                12320.000000  12320  12320          NaN
Distrito Federal           4026.000000   4026   4026          NaN
Guatemala                  7045.200000   3458  13091  3590.132128
Idaho                      6002.000000   6002   6002          NaN
Jalisco                    8924.000000   8924   8924          NaN
Michoacán                  5463.000000   5463   5463          NaN
Montana                    3443.666667   2672   4779  1161.099622
México                     5221.500000   3143   7300  2939.442889
México Morelos Puebla      9974.000000   9974   9974          NaN
México Puebla              5118.000000   5118   5118          NaN
Nevada                     7568.000000   7568   7568          NaN
New Mexico                 2921.333333   2002   4001   710.989920
Puebla Tlaxcala            6299.000000   6299   6299          NaN
Puebla Veracruz           16148.000000  16148  16148          NaN
Utah                       6269.500000   6181   6358   125.157900
Veracruz                   4396.000000   4396   4396          NaN
Washington                10673.000000   8136  13210  3587.859808
Wyoming                    3753.800000   1699   7077  2274.679259
Yukon                      4400.631579   1706  17215  3827.141060